Repository: Ramblurr/Meedan-Open-Translation-Memory--ar-en-
Catalog: MeedanMeemory-2009JUL22.tmx
Source language: en
Languages: ar

source: MAINTAINING trust between Kuwait and Iraq, which vanished after the liberation of Kuwait from the invasion of the Iraqi dictator, requires a thorough analysis of certain facts, particularly the recent exchange of hostile statements aimed at disrupting the
ar: إن عملية الحفاظ على الثقة بين كلٍ من الكويتين و العراقيين و التي تلاشت بعد تحرير الكويت من الغزو العراقي عليها تتطلب تحليل عميق للبعض الحقائق المحددة، و بشكل خاص عملية التبادل الحالية للجمل العدائية و التي يهدف كلا الحزبين من ورائها إلى زعزعة الجهود لكلتا

source: The international community took the necessary steps to help the Iraqis and protect them from the harsh regime, which controlled Iraq for almost 30 years and killed thousands of people. Kuwait served as a transit point for the allied forces to enter Iraq
ar: و قد قام المجتمع الدولي باتخاذ التدابير الأساسية الضرورية بهدف مساعدة العراقيين على حماية أنفسهم من ذلك النظام الحاكم الطاغي، و الذي حكم العراق لما يقرب من ثلاثين عاماً و قام بقتل الآلاف من الأفراد في ذلك الوقت. و قد مثلت الكويت نقطة ولوج و دخول للقوى الم

source: As highlighted above, Kuwait has been helping Iraqis and it is now asking Iraq to comply with international decisions, including Article 678 on the protection of Kuwaiti rights and granting compensation for damages caused by the invasion, in addition to A
ar: و كما تم الإشارة إليه مسبقاً، فقد قامت الحكومة الكويتية بمساعدة العراقيين و الآن تطلب من العراق أن تنصاع لتلك القرارات الدولية التي تم إتخاذها في شأنها، متضمنةً المادة 678 حول حماية الحقوق الكويتية و توفير التعويضات للأضرار التي نتجت عن الغزو العراقي للكو

source: However, the Iraqis shall not be deceived by the emotional tirade of their leaders over the compensation issue. Kuwait deserves compensation for the damages caused by the Iraqi invasion, but money is not the priority of its people. What matters now is f
ar: بالرغم من ذلك فلن يتأثر العراقيين بالإتجاهات العاطفية لقادتهم السياسيين حول تلك القضية المتعلقة بالتسوية و التعويضات. فالكويت تستحق تعويضات عن الأضرار الناجمة عن الغزو العراقي، إلا أن النقود ليست أولوية الشعب الكويتي. فكل ما يهم هنا هو من أجل العراق من أج

source: Iraqi lawmakers demand halt to Kuwait reparations
ar: نواب البرلمان العراقي يطالبون وقف دفع التعويضات للكويت

source: BAGHDAD (AFP) — Iraqi MPs on Monday urged a halt to reparation payments to Kuwait for Saddam Hussein's 1990 occupation, with some wanting the emirate to compensate Iraq for its role in the US-led 2003 invasion.
ar: بغداد (أ ف ب) – طالب نواب البرلمان العراقي يوم الاثنين وقف دفع التعويضات إلى الكويت عن احتلال نظام صدام حسين للكويت عام 1990 مع مطالبة البعض للكويت لتعويض العراق عن دورها في الغزو الذي قادته الولايات المتحدة عام 2003.

source: We request a parliamentary debate to seek financial compensation from Kuwait for having allowed American forces to use its territory for the attack on Iraq and to cause damage and destruction here, Sunni MP Ezzedine al-Dawla of the National Concord Fron
ar: وقال النائب السني عز الدين الدولة من الجبهة التوافق الوطني نطالب بإجراء مناقشة برلمانية لالتماس تعويضات مالية من الكويت للسماح للقوات الأمريكية باستخدام أراضيها في الهجوم على العراق وإلحاق الضرر والدمار به.

source: Kurdish MP Mahmud Othman said Iraq cannot accept the new border with Kuwait because it was imposed on us by the United Nations in 1991 after Saddam's forces were driven out of Kuwait.
ar: وقال النائب الكردي محمود عثمان إن العراق لا يمكن أن يقبل الحدود الجديدة مع الكويت التي فُرضت عليه من قبل الأمم المتحدة في 1991 بعد طرد قوات صدام من الكويت.

source: A senior Kuwaiti official last week called on Iraq to implement UN resolutions before the lifting of sanctions in place since 1990.
ar: ودعا مسئول كويتى كبير في الأسبوع الماضي العراق إلى تطبيق قرارات الأمم المتحدة قبل رفع العقوبات المفروضة عليه منذ عام 1990.

source: We understand the Iraqi desire to exit from Chapter 7, Kuwaiti foreign ministry undersecretary Khaled al-Jarallah was quoted as saying by Al-Qabas newspaper.
ar: ونقلت صحيفة القبس عن وكيل وزارة الخارجية الكويتية خالد الجار الله قوله نحن نتفهم رغبة العراقيين في الخروج من الفصل السابع.

source: But there are obligations (on Iraq) and outstanding issues that are illogical to be left unresolved, he added.
ar: وأضاف ولكن هناك التزامات (على العراق) وقضايا عالقة ليس من المنطق أن تُترك دون حل.

source: The binding Chapter 7 of the UN Charter, which is invoked in case of threats to international peace and security, can open the door to sanctions or even military action.
ar: وقد يفتح الفصل السابع الملزم من ميثاق الامم المتحدة الذي يُفرض في حالة وجود خطر على السلم والأمن الدوليين الباب أمام فرض عقوبات أو حتى إتخاذ عمل عسكري.

source: Kuwaiti officials said in April that Iraq still owes the oil-rich emirate 25.5 billion dollars in reparations for its seven-month occupation of the country under the regime of executed Iraqi dictator Saddam Hussein.
ar: وقال مسئولون كويتيون في أبريل إن العراق لا تزال تدين للإمارة الكويتية الغنية بالنفط بحوالي 25.5 مليار دولار من التعويضات للغزو العراقي للكويت الذي استغرق سبعة أشهر بقيادة الدكتاتور العراقي المشنوق صدام حسين.

source: In addition, Kuwait says Baghdad owes the emirate around 16 billion dollars in debt from loans to Saddam during Baghdad's eight-year war with Iran.
ar: وتقول الكويت أيضاً أن العراق يدين لها أيضاً بحوالي 16 مليار دولار أخرى من القروض التي استدانها صدام خلال حرب الثماني سنوات مع إيران.

source: The Unbearable Narcissism of the Settlers
ar: نرجسية المستوطنين التي لا تحتمل

source: From
ar: جاء في صحيفة

source: Yedio
ar: يدعوت

source: t, further ridiculousness from settler leaders, who have no sense whatsoever about the actual threats facing Israel, and no sense at all of how they sound to the world, and to their fellow Jews:
ar: أن المزيد من ا لتفاهة يبدر عن قادة المستوطنين، الدين لا يدركون البتة التهديد الدي يواجههم في إسرائيل في الوقت الراهنن كما لا يدركون، وبشكل أكبر، كيف يبجون للعالم ولإخوانهم اليهود:

source: The demand to prevent natural growth in settlements is unreasonable and is akin to Pharaoh's demand that all firstborn sons be thrown into the Nile River, said Science and Technology Minister Daniel Hershkowitz ahead of Sunday's weekly cabinet meeting.
ar: ورد على لسان وزير العلوم وتاتكنولوجيا، دانييل هيرشكوفيتش، قبل الاجتمع الأسبوعي لمجلس الوزراء: إن المطابة بالحيلولة دون التطور الطبيعي للمستوطنات أمر غير معقول وشبيه بما قام به فرعون عندما مر بإلقاء جميع المواليد الذكور الجدد في نهر النيل

source: What will we say to a family living with one child, which now has four or five children? That the children will move to Petah Tikva? The Americans must understand that this is an unreasonable demand, and we must confront them firmly, he added.
ar: وأضاف قائلا: ما الذي سنقوله لأسرة تعيش مع طفل واحد، وأصبحت اليوم تتوفرعلى أربعة أطفال أو خمسة؟ هل سنقول لهم إنه يتعين على الأطفال الانتقال إلى بيتاه تيكيا؟ ينبغي على الأمريكيين أن يفهموا أن ذلك مطلب غير معقول وعلينا أن نواجههم بحزم.

source: Where to begin with this nonsense? With the implicit accusation that Barack Obama is pharaoh (which makes Hillary his vizier, or something)? Since the United States partially underwrites Israel, it has the right to make certain demands; since this demand
ar: من أين سنبدأ هذه الترهات؟ هل من الاتهام المبطن بأن باراك أوباما هو فرعون (الأمر الذي يجعل هيلاري كلنتون هي وزيرته أو شيء من هذا القبيل)؟ وعلى اعتبار أن الولايات المتحدة تقدم الدعم لإسرائيل، فمن حقها المطالبة ببعض الأمور؛ وبما أن تلك المطالب تتعلق بأمور تف

source: move to Israel
ar: الذهاب إلى إسرائيل..

source: . That's right. It used to be that a person could fulfill his Zionist destiny in a place like Petah Tikva, but no more: Now, it's a sin against God, apparently, to live anywhere but in a government-subsidized trailer on a barren hill in the mountains of S
ar: هذا صحيح. لقد كان ممكنا أن يمارس شخص ما مصيره الصهيوني في مكان مثل بيتاه تيكيا، لا غير. أما اليوم، فقد أضحى جليا أنه من مظاهر عصيان الرب أن يتم العيش في مكان آخر غير مقطورة مدهعومة من طرف الحكومة فوق تلة عارية في جبال سمارية.

source: I don't have any problem with the American demand for a settlement freeze; the settlements are an impediment to peace, they are a security burden, and they are petri dishes for the worst sort of
ar: ليست ثمة أي مشكل لي مع المطلب الأمريكي بوقف المستوطنات؛ فهاته الأخيرة تشكل عائقا للسلام، وتمثل عبئا أمنيا، وأطباقا مهيأة لأسوأ أنواع

source: fundamentalist messianism
ar: التشدد الديني

source: (and therefore profoundly anti-Zionist, at least according to the Zionist vision of men like Herzl and Ben-Gurion).
ar: (وبالتالي المعاداة الشديدة للصهيونية، على الأقل حسب التصور الصهيوني لأشخاص من طينة هيرزل وبن غوريون).

source: Now, of course, there should be some delineating going on here -- everyone knows that most settlements would actually become part of Israel in a final peace deal. So these settlements should probably be allowed natural growth. But only if the settlements
ar: وبطبيعة الحال، لا بد من وضع تحديد هنا –الجميع يعلم أن جل المستعمرات قد تصبح جزءا من إسرائيل في إطار اتفاق سلام نهائي. وعليه، فإنه يتعين ربما السماح بتطورها الطبيعي. إلا إذا تم تجميد المستوطنات التي توجد خارج الجدار الأمني، وهي تلك الموجودة في قلب الجزء ال

source: Israel and its friends in America know that the only hope for a two-state solution come in the form of an empowered and moderate Palestinian Authority. Is there a good chance that the Palestinian Authority isn't, in fact, moderate? Is there a good chance
ar: إن إسرائيل وأصدقاءها في أمريكا يدركون أن الأمنية الوحيدة لحل الدولتين يكمن في سلطة فلسطينية معتدلة ومدعومة. هل ثمة مجال للقول إن السلطة الفلسطيني ليست في الحقيقة معتدلة؟ هل ثمة مجال للقول إن السلطة الفلسطينية لن تكون أبدا قوية؟ أجل. لكن هذا هو الأمل الوحي

source: Check it -Islam's Reformation and Obama's Speech:
ar: انظر لهذا - الإصلاح الإسلامي و خطاب أوباما:

source: kaitfoley
ar: كيت فولي:

source: about 1 hour ago
ar: منذ حوالي ساعة

source: Obama's
ar: ينبغي على خطاب أوباما

source: #Cairospeech
ar: في القاهرة

source: June 4 should note there is no Muslim World
ar: أن ينوه إلى عدم وجود العالم الإسلامي.

source: Photo of Obama's arrival in Saudi Arabia today-
ar: صورة لأوباما عند وصوله إلى السعودية اليوم -

source: lisang
ar: ليسانغ

source: : Tired of the negativity re: Obama's
ar: رد على: تعبت من السلبية :

source: What do we really want from Obama's visit?
ar: مالذي نريده فعلا من زيارة أوباما?

source: Another test of value of twitter -- following updates from cairo on The Speech
ar: اختبار أخر لقيمة تويتر -- متابعة التطورات من القاهرة بالنسبة للخطاب

source: Obama turns Cairo upsidedown RT
ar: أوباما يقلب القاهرة رأسا على عقب

source: work gave the day off tomorrow, son school off two. operation cairosiege is well underway
ar: أعطي العمال عطلة يوم غد, و المدارس انقطعت أيضا. و عملية كايرو سيج تجري بشكل جيد جدا.

source: 7 opinions from muslim world on
ar: سبعة أراء من العالم الإسلامي

source: Geeee
ar: غي

source: a Yaminy prisoner dies in guantanamo. this one is on you mr. obama
ar: وفاة سجين يمني في غوانتانامو. و هذا الأمر يعود عليك سيد أوباما.

source: what about also the victims in iraq , afghanistan , palestine and pakistan
ar: و ماذا عن الضحايا في العراق و أفغانستان و فلسطين و باكستان أيضا؟

source: الاعلام الفضائى التابع للنظام كاعاشرة مساءا و90 دقيقة والقاهرة اليوم بدأو يهللون ويروجون لاهمية زيارة اوباما
ar: بدأ الإعلام الفضائي التابع للنظام منذ الساعة العاشرة و تسع دقائق مساء اليوم يهلل و يروج لأهمية زيارة أوباما.

source: i may be the only person in cairo who has to go to work tomorrow.
ar: ربما أكون الشخص الوحيد الموجود في القاهرة الذي عليه أن يذهب إلى العمل غدا.

source: (or at least my twitter feed makes me think so.)
ar: ( أو على الأقل تويتر الخاص بي يدفعني إلى هذا الاعتقاد. ).

source: White house web site says
ar: يقول الموقع الخاص بالبيت الأبيض

source: at 6:10AM ET
ar: أن الخطاب سيكون في الساعة السادسة و عشر دقائق بالتوقيت الشرقي

source: Anybody knows exactly when Obama's
ar: هل يعلم أحد بالضبط متى سيتم بث خطاب أوباما؟

source: to be live-streamed here:
ar: أن يتم نقله على الهواء هنا:

source: Sad that Obama will not see true Cairo tomorrow. Egyptians told to stay home. Cars will be off the roads. A ghost town awaits.
ar: من المحزن أن أوباما لن يرى القاهرة على حقيقتها غدا. فقد أجبر المصريون على البقاء في منازلهم. و لن تتواجد السيارات في الطرق. تنتظره مدينة أشباح.

source: Report: EReader and EBook Market Ready for Growth
ar: # تقرير: سوق القارئ الالكتروني و الكتب الالكترونية جاهزة للنمو

source: 48 Hours
ar: 48 ساعة:

source: After 48 hours or even less President Barack Obama’s historical visit to Egypt , it is historical by all measure considering the fact that he will be the first American President to address the Islamic World directly from Cairo. There
ar: بعد ثمانية وأربعين ساعة أو أقل سيقوم باراك أوباما بزيارته التاريخية إلى مصر. وهي زيارة تاريخية بكل المقاييس على اعتبار أنها أول مرة سيخاطب فيها رئيس أمريكي العالم الإسلامي مباشرة من القاهرة.

source: The visit will be from 10 AM to 6 PM
ar: ستتم الزيارة بين الساعة العاشرة صباحا والسادسة مساء.

source: The speech will be 50 minutes “this is pretty long”
ar: سيمتد الخطاب لخمسين دقيقة، هذه مدة طويلة نوعا ما.

source: There will an international press center in Cairo University.
ar: سيكون ثمة مركز للإعلام الدولي بجامعة القاهرة.

source: Obama will visit : El-Kobah Palace, Al-Azhar Mosque , Sultan Hassan Mosque, Pyramids and Cairo University , I do not know if this is the real program because it can change in any time.
ar: سيزور أوباما قصر القبة، جامع الأزهر، مسجد السلطان حسن، الأهرامات وجامعة القاهرة. أنا لست متأكدا أنه البرنامج الحقيقي، لأنه قد يطرأ عليه تغيير في أية لحظة.

source: There were helicopters all over Cairo yesterday , I saw one over Agouza in Giza ,many friends saw it all over Cairo.
ar: كانت ثمة مروحيات تحلق فوق القاهرة يوم أمس، شاهدت واحدة فوق منطقة العجوزة بالجيزة، وشاهدها العديد من الأصدقاء في مناطق أخرى من القاهرة.

source: Ain Shams and Helwan Universities are going to take the day off , from point of view the students may not be able to go to their universities for exams and from another point of view mainly
ar: ستتوقف الدراسة بجامعتي عين شمس وحلوان ليوم واحد. وبالنسبة للطلبة، فإنه يتعذر عليهم الالتحاق بجامعاتهم لاجتياز الامتحانات.

source: Of course Cairo and Giza are being beatified for the distinguish guest, this is something I can understand , it is always done when some VIP visits the area. In case of Obama ,well things are
ar: لقد تما تهيئة القاهرة والجيزة لاستقبال هذا الضيف المميز، وهذا أمر أتفهمه لأنه يحدث كلما حلت شخصية بارزة بالمنطقة. وهذه المرة، تم إعداد كل شيء.

source: I know that there are 5 bloggers at least are going to attend the speech including some of my friends.
ar: على حد علمي، فهناك خمسة مدونين سيحضرون حفل إلقاء الخطاب، ومن بينهم بعض من أصدقائي.

source: Ayman Nour and some MBs members are going to attend the speech, in fact the head of the MB members in the Parliament was invited by Fathi Sorror himself to attend speech.
ar: سيكون أيمن نور وبعض أعضاء الإخوان المسلمين حاضرين في الحفل ، والحقيقة أن رئيس الإخوان المسلمين بمجلس الشعب تمت دعوته من طرف فتحي سرور شخصي لحضور حفل إلقاء الخطاب.

source: Adel Emam and Hamda Halal are going to attend to the speech !!!!!!!!!!
ar: سيحضر عادل إمام وحمادة هلال أثناء إلقاء الخطاب!!!!

source: Kafya is calling for a protest in Al-Tahrir square objecting the visit of Obama !! Yes some groups mainly from the socialists and leftists plus the Arab nationalists do not welcome the visit.
ar: حركة «كفاية» تدعو إلى الاحتجاج بميدان التحرير اعتراضا على زيارة أوباما!! بالفعل هناك عدم ترحيب بزيارة أوباما، سيما من طرف بعض المجموعات خاصة الاشتراكية واليسارية إلى جانب القوميين العرب.

source: There are orders given by the interior ministry to shops and businesses in Downtown area to close on Thursday and do not open up till 3 PM !! in other words it could be a day off.
ar: ثمة أوامر أصدرتها وزارة الداخلية للمتاجر والشركات في مناطق وسط المدينة لتغلق أبوابها يوم الخميس، وألا تفتح إلا بعد الساعة الثالثة بعد الزوال!! بعبارة أخرى، فالأمر شبيه بعطلة.

source: Of course there are thousands of CIA agents currently in Cairo and Giza.
ar: بطبيعة الحال، هناك آلاف من أفراد وكالة الاستخبارات المركزية الأمريكية منتشرين في القاهرة والجيزة.

source: There is a crisis in CU because of the Israeli Ambassador’s invitation , the CU professors refuse to let the ambassador to enter the campus.
ar: هناك أزمة في جامعة القاهرة بسبب توجيه دعوة لسفير إسرائيل، ورفض أساتذة الجامعة السماح للسفير بدخول الحرم الجامعي.

source: I took some shots for Cairo University yesterday in a hurry , there were cars loaded with asphalt to make the road look elegant !! There are not good shots , I will upload them later.
ar: القتطت بعض الصور، لكن بشكل مستعجل، لعربات بجامعة القاهرة وهي محملة بالإسفلت لجعل الطريق تبدو أنيقة!! الصور غير واضحة، وسأقوم بتحميلها لاحقا.

source: I wish that I can attend the speech in personal to be honest. The Egyptian people for real are so interested to hear
ar: بصراحة، أتمنى لو كان بإمكاني حضور حفل إلقاء الخطاب مباشرة. فالحقيقة أن الشعب المصري مهتم بسماع ذلك الخطاب.

source: Mubarak will meet Obama at Koubbah Palace only , he won't attend the speech in Cairo University according to Al-Muslamany's TV show on Dream TV 2 !!!!
ar: سيلتقي مبارك بأوباما في قصر القبة، ولن يحضر الخطاب الذي سيلقيه بجامعة القاهرة، حسب ما أوردته قناة «دريم2» عبر البرنامج الذي يقدمه المسلماني!!!

source: I think his absence from the speech will raise many question marks about his condition after the death of his grandchild.
ar: أعتقد أن غيابه عن حضور الخطاب سيثير العديد من علامات الاستفهام بخصوص حالته الصحية بعد وفاة حفيده.

source: The people living in Khalifa Al-Mamoun were ordered to close their shops and businesses on Thursday , find another place to park their cars and Not To Look Through the balconies or windows !!! Al-Khalifa street is big, there are malls , companies, it is v
ar: المواطنون الذين يعيشون في منطقة الخليفة المأمون تلقى أوامر بإغلاق متاجرهم يوم الخميس، والبحث عن أماكن أخرى يركنون فيها سياراتهم وعدم الإطلال من شرفات ونوافذ منازلهم!!! شارع الخليفة كبير ويضم العديد من المراكز التجارية والشركات. إنه شارع يتميز بنشاطه الكبي

source: Just finished watching Bushama's booooooooooring speech, you can read the full text
ar: أنتهيت للتو من مشاهدة خطاب بوشامة الممل، يمكنك قراءة النص الكامل

source: . My expectation that Obama would just recycle old bullshit obviously came true, and if anyone calls his speech
ar: - توقعاتي بأن اوباما يجدد التفاهات القديمة, جاءت صحيحة، وإذا أدعى أى شخص بأن خطابه

source: or a new beginning they obviously have lost touch with reality. This speech was so bad I thought even from a linguistic standpoint, I mean I could come up with a more . speech off the top of my head, but then again, despite what some people say, Bus
ar: او بداية جديدة فأنهم أبتعدوا عن الحقيقة تماماً. هذا الخطاب كان سئ جداً حتي من الناحية اللغوية، أعني إنى أستطيع أن أأتى بخطاب افضل لغوياً من رأسي،وبالرغم من ما يقوله البعض، بوشاما ليست متحدثاً جيداً. وقد قصد أن ينطق كل كلمة عربية تضمنها حديثه خطأ

source: : Obama says Mubarak has decades of experience, thanks president for hospitality #cairospeech
ar: : واوباما يقول مبارك لديه عقود من الخبرة شكراً للرئيس ل حسن الضيافة #cairospeech

source: mubarak does have years of experience in obeying his american and israeli masters, he also has a lot of experience in torture #cairospeech
ar: مبارك لديه سنوات من الخبرة في إطاعه رؤسائه الأمريكان والأسرائليين, كما لديه أيضاً الكثير من الخبرة فى التعذيب #cairospeech

source: el azaaaaaaaaaaaaaaar? whats that obama??? #cairospeech
ar: الأزهر؟؟ ما هذا يا اوباما؟؟ #cairospeech

source: mentioned extremists within a minute of starting #cairospeech
ar: ذكر المتطرفين في خلال دقيقة من بداية #cairospeech

source: : I hate it when US presidents quote the Quran.. Give me a fucking break! #cairospeech
ar: : اتضايق عندما يذكر الرؤساء الأميركيين القران. أوقفوا هذا #cairospeech

source: obama will fight stereotypes against islam...er while killing as many muslims as possible #cairospeech
ar: سيحارب أوباما العرقية ضد الأسلام...بينما يقتل ما يمكنه من المسلميين#cairospeech

source: the us is a imperial empire you dumb fuck! #cairospeech
ar: الولايات المتحدة هي امبراطورية استعمارية، إنك لأخرق #cairospeech

source: : NDP Stooges must stop clapping in #cairospeech
ar: على أعضاء الحزب الوطنى المهرجون أن يوقفوا التصفيق #cairospeech

source: first problem: violent extremists fuck you dumbass #cairospeech
ar: المشكلة الاولي: عنف المتطرفين اللعنة عليك أيها الأخرق #cairospeech

source: how many people has the us killed in the last 7 years? at least in the millions #cairospeech
ar: كم قتلت أمريكا فى السبع سنين الماضية ؟ على الاقل ملايين #cairospeech

source: military force will not solve the problem alone...er but we will try #cairospeech
ar: القوة العسكرية لن تحل المشكلة بمفردها .لكننا سنحاول #cairospeech

source: Arab Students Respond to Obama
ar: استجابة الطلاب العرب لاوباما

source: Ingy Hassieb
ar: انجي حسيب

source: President Barack Obama, carrying the “goodwill of the American people,” greeted the Egyptian people in Cairo University’s conference hall with “Al Salamu Alaykom.” He did not thank the Egyptian president for his hospitality, he did not address him directl
ar: اوباما الرئيس الذي يحمل نوايا الشعب الامريكي, قام بتحية الشعب المصري في قاعة المؤتمرات بجامعة القاهرة قائلاً السلام عليكم لم يشكر الرئيس المصري لحسن ضيافته, لا يتوجه إليه مباشرة, لكنه وجه خطابه الي الشعب، إلى العالم العربي، إلي العالم الاسلامي.

source: The New York Times asked students in Cairo, Alexandria and Amman to share their thoughts on the president’s speech. Here are some of their impressions:
ar: سألت نيويورك تايمز الطلاب في القاهرة، الإسكندرية وعمان لمشاركة أفكارهم حول خطاب الرئيس. إليكم بعضاً من انطباعاتهم:

source: The speech that President Barack Obama gave at Cairo University was very interesting and refreshing. It was definitely a big break from the tone and style that President Bush employed in addressing the Arab world. The speech was balanced and not aggressiv
ar: إن الخطاب الذي ألقاه الرئيس اوباما في جامعة القاهرة كان ممتعاً جدا ومتغير. لقد كان مختلفا عن لهجة و إسلوب الرئيس بوش في مواجهة العالم العربي. لقد كان الخطاب متوازن وليس عدوانيا كما أعلن الرئيس اوباما ان اولى اهتماماته هى خدمة و حماية شعبه و في نفس الوق

source: Google Inc. said it plans to launch a program that will let publishers sell digital versions of their books directly to consumers, a step that would thrust the Internet search giant into competition with e-commerce leader Amazon.com Inc.
ar: ذكرت شركة جوجل أنها تعتزم إطلاق برنامج يساعد الناشرين على بيع النسخ الإلكترونية لكتبهم للقراء مباشرة وهي خطوة ستُدخل عملاق البحث الإلكتروني جوجل في منافسة شرسة مع رائد بيع الكتب على الانترنت امازون.

source: Google, Mountain View, Calif., said Monday it aims to build a digital book ecosystem to allow partner publishers to sell access to their titles, even if buyers don't have dedicated book readers such as Amazon's Kindle or Sony Corp.'s Reader. The service
ar: وفالت جوجل ، مونتن فيو- كاليفورنيا أنها ستعمل على بناء بيئة حيوية للكتاب الرقمي وذلك للسماح لشركائها من الناشرين ببيع حق فراءة كتبهم للمشترين حتى وإن لم يكونوا يمتلكوا برامج الفراءة من عينة Kindle الذي تنتجه أمازون أو قاريء Sony Corp.'s Reader . كان

source: Mahmoud Ahmadinejad in bitter TV clash with Iranian poll rival
ar: محمود أحمدي نجاد في اشتباك تلفزيوني حاد مع منافسه الإيراني في الانتخابات

source: 's president has traded personal attacks and accusations with his main election rival last night in a bitterly contested televised debate seen as key to deciding the country's forthcoming presidential election. In an extraordinarily barbed 90-minute live
ar: تبادل الرئيس الإيراني الهجمات والإتهامات الشخصية مع منافسه الرئيسي في الانتخابات الليلة الماضية خلال مناظرة تلفزيونية يُنظر إليها على أنها عامل رئيسي في تحديد الانتخابات الرئاسية المقبلة في البلد، وفي مقابلة شائكة غير عادية استغرقت 90 دقيقة، أطلق محمود أح
